
import java.util.Scanner;  
public class Manual {
  public static void instructions() {
	  
	  System.out.println("1.Οδηγίες χρήσεων. ");
	  System.out.println("2.Εισαγωγή στοιχείων του ασθενούς.");
	  System.out.println("3.Διαγραφή ενός ασθενούς.");
	  System.out.println("4.Ενημέρωση με email στον ασθενή.");
	  System.out.print("5.Επέλεξε από ένα 1 έως 4: ");
	  
	  Scanner answer = new Scanner(System.in);  
 
	
	switch (answer.nextInt()) {
	  case 1:
	    System.out.println("Η εφαρμογή CleverDoctor είναι διαχειρίσιμη από κάθε γιατρό που αποθηκεύει\n τα στοιχεία του κάθε ασθενή που έχει προσβληθεί από τον COVID-19. \n"
	    		+ "Αρχικά, εμφανίζεται το αρχικό μενού με τις επιλογές.\n"
	    		+ "Πατώντας το 1 ο κάθε γιατρός διαβάζει αναλυτικά τις οδηγίες χρήσεων για να\n μπορέσει να καταγράψει σωστά τα στοιχεία του ασθενούς που έχει\n προσβληθεί από τον ιό."
	    		+ "Μπαίνοντας στην εφαρμογή μπορείτε\n να διαλέξετε τις επιλογές από 1 εώς 4." 	
	    		+ "Σε κάθε επιλογή, θα σας εμφανιστούν οι κατάλληλες οδηγίες για\nτο κάθε στοιχείο ξεχωριστά. "
	    		+ "Πατήστε το νούμερο 2, όπου θα\n σας ζητηθεί να γίνει εισαγωγή των στοιχείων του ασθενή όπως\n το ονοματεπώνυμο τους ασθενούς,την ημερομηνία  "
	    		+ "όπου βρέθηκε θετικός στον\n ιό ο ασθενής και τον κωδικό του. "
	    		+ "Πατήστε το 3 για να διαγράψετε έναν ασθενή.\n "
	    		+ "Εισάγεται το έγκυρο email του ασθενούς και των επαφών του πατώντας το νούμερο 4.");
	    break;
	  case 2:
	    System.out.println(" Ζητείται το έγκυρο ονοματεπώνυμο του ασθενούς όπου το πληκτρολογείται και καταγράφεται. "
	    		+ "Όπως επίσης, την έγκυρη ημερομηνία που βρέθηκε θετικός και τον έγκυρο κωδικό του και ύστερα αποθηκεύονται στη μνήμη του προγράμματος ");
	    break;
	  case 3:
	    System.out.println(" Η επιλογή αυτή διαγράφει τους ασθενείς, πληκτρολογώντας το ονοματεπώνυμο του ασθενούς όπου αυτόματα διαγράφεται από το σύστημα. ");
	    break;
	  case 4:
	    System.out.println(" Ενημερώνεται με το κατάλληλο μήνυμα για τα αποτελέσματα του ασθενούς και το στέλνετε μέσω email ώστε να δει τα αποτελέσματά του. "
	    		+ "Αν είναι θετικός στον ιό ειδοποιούνται και οι επαφές του μέσω email.  ");
	    break;
	 default: 
		 System.out.println("Επέλεξε από 1 έως 4");
	}

	
  }

	
}
 


